#配置类 
# 分别定义全局变量：牌面值，花色，牌型，玩家姓名
FACES = ['A', '2', '3', '4', '5', '6', '7', '8', '9', '10', 'J', 'Q', 'K']
COLORS = ['黑桃♠', '红心♥', '方块♦', '梅花♣']
TYPE = ['豹子', '顺金', '顺子', '对子', '单张']
NAMES = ['#Player1', '#Player2', '#Player3', '#Player4', '#Player5']
# 牌组列表初始化为空，玩家组列表初始化为空
CARD_GROUP = list()
PLAYERS = list()
# PRIORITY数组用于比较牌面值，花色，牌型的优先级
# A>K>Q>...>2
# 黑桃>红心>方块>梅花
# 豹子>顺金>顺子>对子>单张
PRIORITY = {'2': 2, '3': 3, '4': 4, '5': 5, '6': 6, '7': 7, '8': 8,
            '9': 9, '10': 10, 'J': 11, 'Q': 12, 'K': 13, 'A': 14,
            '梅花♣': 1, '方块♦': 2, '红心♥': 3, '黑桃♠': 4,
            '单张': 1, '对子': 2, '顺子': 3, '顺金': 4, '豹子': 5
            }